; ModuleID = 'init'
source_filename = "init.rcp"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "arm64v8a-unknown-linux-androideabi34"

%slice.194 = type { i64, ptr }
%__init_TypeInfo.151 = type { i64, %__init_TypeUnion.150 }
%__init_TypeUnion.150 = type { %__init_StructType.142 }
%__init_StructType.142 = type { %slice.189, %string.138, i32 }
%slice.189 = type { i64, ptr }
%string.138 = type { ptr, i64 }
%__init_StructMember.141 = type { %string.138, i64 }
%__init_BasicType.140 = type { i64, i32, i32, %string.138 }
%__init_PointerType.144 = type { i64, i1 }
%__init_EnumType.147 = type { %string.138, %slice.191, i64 }
%slice.191 = type { i64, ptr }
%__init_FunctionType.143 = type { i64, %slice.190 }
%slice.190 = type { i64, ptr }
%__init_ArrayType.145 = type { i64, i32 }

@__main_LogTag = external global ptr
@__main_GLOBAL = external global i64
@__pthread_DETACHED = external global i32
@__init_INVALID_TYPE = global i64 0
@__init_type_table = global %slice.194 zeroinitializer
@__os_stdin = external global i64
@__os_stdout = external global i64
@__os_stderr = external global i64
@__os_SYS_read = external global i64
@__os_SYS_write = external global i64
@__os_SYS_open = external global i64
@__os_SYS_mmap = external global i64
@__os_SYS_munmap = external global i64
@__os_SYS_exit = external global i64
@__os_PROT_READ = external global i64
@__os_PROT_WRITE = external global i64
@__os_PROT_EXEC = external global i64

!9 = !DIEnumerator(name: "Pointer", value: 4, isUnsigned: true)
!10 = !DIEnumerator(name: "Array", value: 5, isUnsigned: true)
!11 = !DIEnumerator(name: "Slice", value: 6, isUnsigned: true)
!12 = !DIEnumerator(name: "Vector", value: 7, isUnsigned: true)
!13 = !DIEnumerator(name: "Enum", value: 8, isUnsigned: true)
!14 = !DIEnumerator(name: "Generic", value: 9, isUnsigned: true)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_BasicKind", scope: !1, file: !1, size: 64, align: 64, elements: !16)
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35}
!17 = !DIEnumerator(name: "Bool", value: 0, isUnsigned: true)
!18 = !DIEnumerator(name: "String", value: 1, isUnsigned: true)
!19 = !DIEnumerator(name: "U8", value: 2, isUnsigned: true)
!20 = !DIEnumerator(name: "U16", value: 3, isUnsigned: true)
!21 = !DIEnumerator(name: "U32", value: 4, isUnsigned: true)
!22 = !DIEnumerator(name: "U64", value: 5, isUnsigned: true)
!23 = !DIEnumerator(name: "I8", value: 6, isUnsigned: true)
!24 = !DIEnumerator(name: "I16", value: 7, isUnsigned: true)
!25 = !DIEnumerator(name: "I32", value: 8, isUnsigned: true)
!26 = !DIEnumerator(name: "I64", value: 9, isUnsigned: true)
!27 = !DIEnumerator(name: "F32", value: 10, isUnsigned: true)
!28 = !DIEnumerator(name: "F64", value: 11, isUnsigned: true)
!29 = !DIEnumerator(name: "untypedInteger", value: 12, isUnsigned: true)
!30 = !DIEnumerator(name: "untypedFloat", value: 13, isUnsigned: true)
!31 = !DIEnumerator(name: "Int", value: 14, isUnsigned: true)
!32 = !DIEnumerator(name: "Uint", value: 15, isUnsigned: true)
!33 = !DIEnumerator(name: "Type", value: 16, isUnsigned: true)
!34 = !DIEnumerator(name: "Auto", value: 17, isUnsigned: true)
!35 = !DIEnumerator(name: "Module", value: 18, isUnsigned: true)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_BasicFlag", scope: !1, file: !1, size: 32, align: 32, elements: !37)
!37 = !{!38, !39, !40, !41, !42, !43, !44}
!38 = !DIEnumerator(name: "Boolean", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "Integer", value: 2, isUnsigned: true)
!40 = !DIEnumerator(name: "Float", value: 4, isUnsigned: true)
!41 = !DIEnumerator(name: "String", value: 8, isUnsigned: true)
!42 = !DIEnumerator(name: "Untyped", value: 32, isUnsigned: true)
!43 = !DIEnumerator(name: "Unsigned", value: 64, isUnsigned: true)
!44 = !DIEnumerator(name: "TypeID", value: 128, isUnsigned: true)
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_StructFlag", scope: !1, file: !1, size: 32, align: 32, elements: !46)
!46 = !{!47, !48, !49}
!47 = !DIEnumerator(name: "Packed", value: 1, isUnsigned: true)
!48 = !DIEnumerator(name: "Generic", value: 2, isUnsigned: true)
!49 = !DIEnumerator(name: "Union", value: 4, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_VectorKind", scope: !1, file: !1, size: 64, align: 64, elements: !51)
!51 = !{!52, !53}
!52 = !DIEnumerator(name: "Float", value: 0, isUnsigned: true)
!53 = !DIEnumerator(name: "Int", value: 1, isUnsigned: true)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__compile_CompileFlag", scope: !1, file: !1, size: 32, align: 32, elements: !55)
!55 = !{!56, !57, !58, !59, !60, !61, !62, !63, !64}
!56 = !DIEnumerator(name: "Debug", value: 1, isUnsigned: true)
!57 = !DIEnumerator(name: "SanAddress", value: 2, isUnsigned: true)
!58 = !DIEnumerator(name: "SanMemory", value: 4, isUnsigned: true)
!59 = !DIEnumerator(name: "SanThread", value: 8, isUnsigned: true)
!60 = !DIEnumerator(name: "SanUndefined", value: 16, isUnsigned: true)
!61 = !DIEnumerator(name: "NoStdLib", value: 32, isUnsigned: true)
!62 = !DIEnumerator(name: "SharedLib", value: 64, isUnsigned: true)
!63 = !DIEnumerator(name: "CrossAndroid", value: 128, isUnsigned: true)
!64 = !DIEnumerator(name: "NoLink", value: 256, isUnsigned: true)
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__android_LogPriority", scope: !1, file: !1, size: 32, align: 32, elements: !66)
!66 = !{!67, !68, !69, !70, !71, !72, !73, !74, !75}
!67 = !DIEnumerator(name: "UNKNOWN", value: 0, isUnsigned: true)
!68 = !DIEnumerator(name: "DEFAULT", value: 1, isUnsigned: true)
!69 = !DIEnumerator(name: "VERBOSE", value: 2, isUnsigned: true)
!70 = !DIEnumerator(name: "DEBUG", value: 3, isUnsigned: true)
!71 = !DIEnumerator(name: "INFO", value: 4, isUnsigned: true)
!72 = !DIEnumerator(name: "WARN", value: 5, isUnsigned: true)
!73 = !DIEnumerator(name: "ERROR", value: 6, isUnsigned: true)
!74 = !DIEnumerator(name: "FATAL", value: 7, isUnsigned: true)
!75 = !DIEnumerator(name: "SILENT", value: 8, isUnsigned: true)
!76 = !{i32 2, !"CodeView", i32 1}
!77 = !{i32 2, !"Debug Info Version", i32 3}
!78 = distinct !DISubprogram(name: "get_struct_alignment", linkageName: "__init_get_struct_alignment", scope: !1, file: !1, line: 155, type: !79, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !83)
!79 = !DISubroutineType(types: !80)
!80 = !{!81, !82}
!81 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!82 = !DIBasicType(name: "type", size: 64, encoding: DW_ATE_unsigned)
!83 = !{}
!84 = !DILocation(line: 155, scope: !78)
!85 = !DILocalVariable(name: "st", scope: !78, file: !1, line: 155, type: !82)
!86 = !DILocation(line: 156, scope: !78)
!87 = !DILocalVariable(name: "t", scope: !78, file: !1, line: 156, type: !88)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_StructType", scope: !1, file: !1, size: 320, elements: !89)
!89 = !{!90, !107, !108}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "members", scope: !1, file: !1, baseType: !91, size: 128, align: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, scope: !92, file: !92, size: 128, align: 64, elements: !93)
!92 = !DIFile(filename: "main.rcp", directory: "E:\\Non_C_Projects\\RCPProjects\\Android\\src")
!93 = !{!94, !95}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !92, file: !92, baseType: !81, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !92, file: !92, baseType: !96, size: 64, align: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*__init_StructMember", baseType: !97, size: 64, align: 64, dwarfAddressSpace: 0)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_StructMember", scope: !92, file: !92, size: 192, elements: !98)
!98 = !{!99, !106}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !92, file: !92, baseType: !100, size: 128, align: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", scope: !92, file: !92, size: 128, elements: !101)
!101 = !{!102, !105}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !92, file: !92, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*u8", baseType: !104, size: 64, align: 64, dwarfAddressSpace: 0)
!104 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !92, file: !92, baseType: !81, size: 64, align: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !92, file: !92, baseType: !82, size: 64, align: 64, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1, file: !1, baseType: !100, size: 128, align: 64, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1, file: !1, baseType: !109, size: 32, align: 32, offset: 256)
!109 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!110 = !DILocation(line: 157, scope: !78)
!111 = !DILocation(line: 158, scope: !78)
!112 = !DILocation(line: 160, scope: !78)
!113 = !DILocalVariable(name: "biggest", scope: !78, file: !1, line: 160, type: !81)
!114 = !DILocation(line: 161, scope: !78)
!115 = !DILocalVariable(name: "align", scope: !78, file: !1, line: 161, type: !81)
!116 = !DILocation(line: 162, scope: !78)
!117 = !DILocalVariable(name: "m", scope: !78, file: !1, line: 162, type: !118)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_StructMember", scope: !1, file: !1, size: 192, elements: !119)
!119 = !{!120, !121}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1, file: !1, baseType: !100, size: 128, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !1, file: !1, baseType: !82, size: 64, align: 64, offset: 128)
!122 = !DILocalVariable(name: "i", scope: !78, file: !1, line: 162, type: !81)
!123 = !DILocation(line: 163, scope: !78)
!124 = !DILocalVariable(name: "size", scope: !78, file: !1, line: 163, type: !81)
!125 = !DILocation(line: 164, scope: !78)
!126 = !DILocation(line: 165, scope: !78)
!127 = !DILocation(line: 166, scope: !78)
!128 = !DILocation(line: 170, scope: !78)
!129 = distinct !DISubprogram(name: "get_type_alignment", linkageName: "__init_get_type_alignment", scope: !1, file: !1, line: 173, type: !79, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !83)
!130 = !DILocation(line: 173, scope: !129)
!131 = !DILocalVariable(name: "t", scope: !129, file: !1, line: 173, type: !82)
!132 = !DILocation(line: 174, scope: !129)
!133 = !DILocalVariable(name: "ti", scope: !129, file: !1, line: 174, type: !134)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_TypeInfo", scope: !1, file: !1, size: 384, elements: !135)
!135 = !{!136, !138}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !1, file: !1, baseType: !137, size: 64, align: 64)
!137 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_TypeKind", scope: !92, file: !92, size: 64, align: 64, elements: !4)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !1, file: !1, baseType: !139, size: 320, align: 64, offset: 64)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_TypeUnion", scope: !1, file: !1, size: 320, elements: !140)
!140 = !{!141, !148, !149, !158, !164, !169, !172, !181, !187}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "basic", scope: !1, file: !1, baseType: !142, size: 256, align: 64)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_BasicType", scope: !1, file: !1, size: 256, elements: !143)
!143 = !{!144, !146, !147, !107}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !1, file: !1, baseType: !145, size: 64, align: 64)
!145 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_BasicKind", scope: !92, file: !92, size: 64, align: 64, elements: !16)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1, file: !1, baseType: !109, size: 32, align: 32, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1, file: !1, baseType: !109, size: 32, align: 32, offset: 96)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "struct_", scope: !1, file: !1, baseType: !88, size: 320, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !1, file: !1, baseType: !150, size: 192, align: 64)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_FunctionType", scope: !1, file: !1, size: 192, elements: !151)
!151 = !{!152, !153}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "return_", scope: !1, file: !1, baseType: !82, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "args_t", scope: !1, file: !1, baseType: !154, size: 128, align: 64, offset: 64)
!154 = !DICompositeType(tag: DW_TAG_structure_type, scope: !92, file: !92, size: 128, align: 64, elements: !155)
!155 = !{!94, !156}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !92, file: !92, baseType: !157, size: 64, align: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*type", baseType: !82, size: 64, align: 64, dwarfAddressSpace: 0)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1, file: !1, baseType: !159, size: 128, align: 64)
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_PointerType", scope: !1, file: !1, size: 128, elements: !160)
!160 = !{!161, !162}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "pointee", scope: !1, file: !1, baseType: !82, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "is_optional", scope: !1, file: !1, baseType: !163, size: 8, align: 8, offset: 64)
!163 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !1, file: !1, baseType: !165, size: 128, align: 64)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_ArrayType", scope: !1, file: !1, size: 128, elements: !166)
!166 = !{!167, !168}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !1, file: !1, baseType: !82, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "member_count", scope: !1, file: !1, baseType: !109, size: 32, align: 32, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "slice", scope: !1, file: !1, baseType: !170, size: 64, align: 64)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_SliceType", scope: !1, file: !1, size: 64, elements: !171)
!171 = !{!167}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "enum_", scope: !1, file: !1, baseType: !173, size: 320, align: 64)
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_EnumType", scope: !1, file: !1, size: 320, elements: !174)
!174 = !{!120, !175, !180}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "member_names", scope: !1, file: !1, baseType: !176, size: 128, align: 64, offset: 128)
!176 = !DICompositeType(tag: DW_TAG_structure_type, scope: !92, file: !92, size: 128, align: 64, elements: !177)
!177 = !{!94, !178}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !92, file: !92, baseType: !179, size: 64, align: 64, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*string", baseType: !100, size: 64, align: 64, dwarfAddressSpace: 0)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !1, file: !1, baseType: !82, size: 64, align: 64, offset: 256)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !1, file: !1, baseType: !182, size: 128, align: 64)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_VectorType", scope: !1, file: !1, size: 128, elements: !183)
!183 = !{!184, !186}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !1, file: !1, baseType: !185, size: 64, align: 64)
!185 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_VectorKind", scope: !92, file: !92, size: 64, align: 64, elements: !51)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "elem_count", scope: !1, file: !1, baseType: !109, size: 32, align: 32, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !1, file: !1, baseType: !188, size: 128, align: 64)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_GenericType", scope: !1, file: !1, size: 128, elements: !189)
!189 = !{!120}
!190 = !DILocation(line: 175, scope: !129)
!191 = !DILocation(line: 177, scope: !129)
!192 = !DILocation(line: 178, scope: !129)
!193 = !DILocalVariable(name: "result", scope: !129, file: !1, line: 175, type: !81)
!194 = !DILocation(line: 200, scope: !129)
!195 = distinct !DISubprogram(name: "get_basic_type_size", linkageName: "__init_get_basic_type_size", scope: !1, file: !1, line: 203, type: !196, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !83)
!196 = !DISubroutineType(types: !197)
!197 = !{!81, !142}
!198 = !DILocation(line: 203, scope: !195)
!199 = !DILocalVariable(name: "t", scope: !195, file: !1, line: 203, type: !142)
!200 = !DILocation(line: 204, scope: !195)
!201 = !DILocation(line: 205, scope: !195)
!202 = !DILocation(line: 206, scope: !195)
!203 = distinct !DISubprogram(name: "get_struct_size", linkageName: "__init_get_struct_size", scope: !1, file: !1, line: 209, type: !79, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !83)
!204 = !DILocation(line: 209, scope: !203)
!205 = !DILocalVariable(name: "st", scope: !203, file: !1, line: 209, type: !82)
!206 = !DILocation(line: 210, scope: !203)
!207 = !DILocalVariable(name: "t", scope: !203, file: !1, line: 210, type: !88)
!208 = !DILocation(line: 211, scope: !203)
!209 = !DILocation(line: 212, scope: !203)
!210 = !DILocation(line: 214, scope: !203)
!211 = !DILocalVariable(name: "result", scope: !203, file: !1, line: 214, type: !81)
!212 = !DILocation(line: 215, scope: !203)
!213 = !DILocalVariable(name: "biggest_member", scope: !203, file: !1, line: 215, type: !81)
!214 = !DILocation(line: 216, scope: !203)
!215 = !DILocalVariable(name: "m", scope: !203, file: !1, line: 216, type: !118)
!216 = !DILocalVariable(name: "i", scope: !203, file: !1, line: 216, type: !81)
!217 = !DILocation(line: 217, scope: !203)
!218 = !DILocalVariable(name: "member_size", scope: !203, file: !1, line: 217, type: !81)
!219 = !DILocation(line: 218, scope: !203)
!220 = !DILocalVariable(name: "alignment", scope: !203, file: !1, line: 218, type: !81)
!221 = !DILocation(line: 219, scope: !203)
!222 = !DILocation(line: 220, scope: !203)
!223 = !DILocation(line: 221, scope: !203)
!224 = !DILocation(line: 222, scope: !203)
!225 = !DILocation(line: 223, scope: !203)
!226 = !DILocation(line: 225, scope: !203)
!227 = !DILocation(line: 226, scope: !203)
!228 = !DILocation(line: 227, scope: !203)
!229 = !DILocalVariable(name: "align", scope: !203, file: !1, line: 227, type: !81)
!230 = !DILocation(line: 228, scope: !203)
!231 = !DILocation(line: 229, scope: !203)
!232 = distinct !DISubprogram(name: "get_type_size", linkageName: "__init_get_type_size", scope: !1, file: !1, line: 232, type: !79, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !83)
!233 = !DILocation(line: 232, scope: !232)
!234 = !DILocalVariable(name: "t", scope: !232, file: !1, line: 232, type: !82)
!235 = !DILocation(line: 233, scope: !232)
!236 = !DILocalVariable(name: "ti", scope: !232, file: !1, line: 233, type: !134)
!237 = !DILocation(line: 234, scope: !232)
!238 = !DILocalVariable(name: "result", scope: !232, file: !1, line: 234, type: !81)
!239 = !DILocation(line: 257, scope: !232)
!240 = distinct !DISubprogram(name: "get_struct_member_offset", linkageName: "__init_get_struct_member_offset", scope: !1, file: !1, line: 260, type: !241, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !83)
!241 = !DISubroutineType(types: !242)
!242 = !{!81, !88, !81}
!243 = !DILocation(line: 260, scope: !240)
!244 = !DILocalVariable(name: "st", scope: !240, file: !1, line: 260, type: !88)
