; ModuleID = 'io'
source_filename = "io.rcp"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "arm64v8a-unknown-linux-androideabi34"

%slice.313 = type { i64, ptr }
%string.255 = type { ptr, i64 }
%__init_TypeInfo.268 = type { i64, %__init_TypeUnion.267 }
%__init_TypeUnion.267 = type { %__init_StructType.259 }
%__init_StructType.259 = type { %slice.308, %string.255, i32 }
%slice.308 = type { i64, ptr }
%slice.309 = type { i64, ptr }
%__init_BasicType.257 = type { i64, i32, i32, %string.255 }
%__init_FunctionType.260 = type { i64, %slice.309 }
%__init_PointerType.261 = type { i64, i1 }
%__init_ArrayType.262 = type { i64, i32 }
%__init_SliceType.263 = type { i64 }
%__init_EnumType.264 = type { %string.255, %slice.310, i64 }
%slice.310 = type { i64, ptr }
%__init_GenericType.266 = type { %string.255 }
%__init_Arg.256 = type { i64, ptr }
%__init_StructMember.258 = type { %string.255, i64 }
%slice.312 = type { i64, ptr }
%__mem_Allocator.270 = type { ptr, ptr, ptr }
%slice.314 = type { i64, ptr }
%slice.311 = type { i64, ptr }

@__main_LogTag = external global ptr
@__main_GLOBAL = external global i64
@__pthread_DETACHED = external global i32
@__init_INVALID_TYPE = external global i64
@__init_type_table = external global %slice.313
@__os_stdin = external global i64
@__os_stdout = external global i64
@__os_stderr = external global i64
@__os_SYS_read = external global i64
@__os_SYS_write = external global i64

!2 = !{!3, !15, !36, !45, !50, !54, !65, !3, !15, !36, !45, !50, !54}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_TypeKind", scope: !1, file: !1, size: 64, align: 64, elements: !4)
!4 = !{!5, !6, !7, !8, !9, !10, !11, !12, !13, !14}
!5 = !DIEnumerator(name: "Invalid", value: 0, isUnsigned: true)
!6 = !DIEnumerator(name: "Basic", value: 1, isUnsigned: true)
!7 = !DIEnumerator(name: "Function", value: 2, isUnsigned: true)
!8 = !DIEnumerator(name: "Struct", value: 3, isUnsigned: true)
!9 = !DIEnumerator(name: "Pointer", value: 4, isUnsigned: true)
!10 = !DIEnumerator(name: "Array", value: 5, isUnsigned: true)
!11 = !DIEnumerator(name: "Slice", value: 6, isUnsigned: true)
!12 = !DIEnumerator(name: "Vector", value: 7, isUnsigned: true)
!13 = !DIEnumerator(name: "Enum", value: 8, isUnsigned: true)
!14 = !DIEnumerator(name: "Generic", value: 9, isUnsigned: true)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_BasicKind", scope: !1, file: !1, size: 64, align: 64, elements: !16)
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35}
!17 = !DIEnumerator(name: "Bool", value: 0, isUnsigned: true)
!18 = !DIEnumerator(name: "String", value: 1, isUnsigned: true)
!19 = !DIEnumerator(name: "U8", value: 2, isUnsigned: true)
!20 = !DIEnumerator(name: "U16", value: 3, isUnsigned: true)
!21 = !DIEnumerator(name: "U32", value: 4, isUnsigned: true)
!22 = !DIEnumerator(name: "U64", value: 5, isUnsigned: true)
!23 = !DIEnumerator(name: "I8", value: 6, isUnsigned: true)
!24 = !DIEnumerator(name: "I16", value: 7, isUnsigned: true)
!25 = !DIEnumerator(name: "I32", value: 8, isUnsigned: true)
!26 = !DIEnumerator(name: "I64", value: 9, isUnsigned: true)
!27 = !DIEnumerator(name: "F32", value: 10, isUnsigned: true)
!28 = !DIEnumerator(name: "F64", value: 11, isUnsigned: true)
!29 = !DIEnumerator(name: "untypedInteger", value: 12, isUnsigned: true)
!30 = !DIEnumerator(name: "untypedFloat", value: 13, isUnsigned: true)
!31 = !DIEnumerator(name: "Int", value: 14, isUnsigned: true)
!32 = !DIEnumerator(name: "Uint", value: 15, isUnsigned: true)
!33 = !DIEnumerator(name: "Type", value: 16, isUnsigned: true)
!34 = !DIEnumerator(name: "Auto", value: 17, isUnsigned: true)
!35 = !DIEnumerator(name: "Module", value: 18, isUnsigned: true)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_BasicFlag", scope: !1, file: !1, size: 32, align: 32, elements: !37)
!37 = !{!38, !39, !40, !41, !42, !43, !44}
!38 = !DIEnumerator(name: "Boolean", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "Integer", value: 2, isUnsigned: true)
!40 = !DIEnumerator(name: "Float", value: 4, isUnsigned: true)
!41 = !DIEnumerator(name: "String", value: 8, isUnsigned: true)
!42 = !DIEnumerator(name: "Untyped", value: 32, isUnsigned: true)
!43 = !DIEnumerator(name: "Unsigned", value: 64, isUnsigned: true)
!44 = !DIEnumerator(name: "TypeID", value: 128, isUnsigned: true)
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_StructFlag", scope: !1, file: !1, size: 32, align: 32, elements: !46)
!46 = !{!47, !48, !49}
!47 = !DIEnumerator(name: "Packed", value: 1, isUnsigned: true)
!48 = !DIEnumerator(name: "Generic", value: 2, isUnsigned: true)
!49 = !DIEnumerator(name: "Union", value: 4, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_VectorKind", scope: !1, file: !1, size: 64, align: 64, elements: !51)
!51 = !{!52, !53}
!52 = !DIEnumerator(name: "Float", value: 0, isUnsigned: true)
!53 = !DIEnumerator(name: "Int", value: 1, isUnsigned: true)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__compile_CompileFlag", scope: !1, file: !1, size: 32, align: 32, elements: !55)
!55 = !{!56, !57, !58, !59, !60, !61, !62, !63, !64}
!56 = !DIEnumerator(name: "Debug", value: 1, isUnsigned: true)
!57 = !DIEnumerator(name: "SanAddress", value: 2, isUnsigned: true)
!58 = !DIEnumerator(name: "SanMemory", value: 4, isUnsigned: true)
!59 = !DIEnumerator(name: "SanThread", value: 8, isUnsigned: true)
!60 = !DIEnumerator(name: "SanUndefined", value: 16, isUnsigned: true)
!61 = !DIEnumerator(name: "NoStdLib", value: 32, isUnsigned: true)
!62 = !DIEnumerator(name: "SharedLib", value: 64, isUnsigned: true)
!63 = !DIEnumerator(name: "CrossAndroid", value: 128, isUnsigned: true)
!64 = !DIEnumerator(name: "NoLink", value: 256, isUnsigned: true)
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__android_LogPriority", scope: !1, file: !1, size: 32, align: 32, elements: !66)
!66 = !{!67, !68, !69, !70, !71, !72, !73, !74, !75}
!67 = !DIEnumerator(name: "UNKNOWN", value: 0, isUnsigned: true)
!68 = !DIEnumerator(name: "DEFAULT", value: 1, isUnsigned: true)
!69 = !DIEnumerator(name: "VERBOSE", value: 2, isUnsigned: true)
!70 = !DIEnumerator(name: "DEBUG", value: 3, isUnsigned: true)
!71 = !DIEnumerator(name: "INFO", value: 4, isUnsigned: true)
!72 = !DIEnumerator(name: "WARN", value: 5, isUnsigned: true)
!73 = !DIEnumerator(name: "ERROR", value: 6, isUnsigned: true)
!74 = !DIEnumerator(name: "FATAL", value: 7, isUnsigned: true)
!75 = !DIEnumerator(name: "SILENT", value: 8, isUnsigned: true)
!76 = !{i32 2, !"CodeView", i32 1}
!77 = !{i32 2, !"Debug Info Version", i32 3}
!78 = distinct !DISubprogram(name: "push_string", linkageName: "__io_push_string", scope: !1, file: !1, line: 9, type: !79, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !96)
!79 = !DISubroutineType(types: !80)
!80 = !{null, !81, !90}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*[]u32", baseType: !82, size: 64, align: 64, dwarfAddressSpace: 0)
!82 = !DICompositeType(tag: DW_TAG_structure_type, scope: !83, file: !83, size: 128, align: 64, elements: !84)
!83 = !DIFile(filename: "main.rcp", directory: "E:\\Non_C_Projects\\RCPProjects\\Android\\src")
!84 = !{!85, !87}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !83, file: !83, baseType: !86, size: 64, align: 64)
!86 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !83, file: !83, baseType: !88, size: 64, align: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*u32", baseType: !89, size: 64, align: 64, dwarfAddressSpace: 0)
!89 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", scope: !83, file: !83, size: 128, elements: !91)
!91 = !{!92, !95}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !83, file: !83, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*u8", baseType: !94, size: 64, align: 64, dwarfAddressSpace: 0)
!94 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !83, file: !83, baseType: !86, size: 64, align: 64, offset: 64)
!96 = !{}
!97 = !DILocation(line: 9, scope: !78)
!98 = !DILocalVariable(name: "b", scope: !78, file: !1, line: 9, type: !81)
!99 = !DILocalVariable(name: "to_push", arg: 1, scope: !78, file: !1, line: 9, type: !90)
!100 = !DILocation(line: 10, scope: !78)
!101 = !DILocalVariable(name: "c", scope: !78, file: !1, line: 10, type: !89)
!102 = !DILocalVariable(name: "i", scope: !78, file: !1, line: 10, type: !86)
!103 = !DILocation(line: 11, scope: !78)
!104 = !DILocation(line: 13, scope: !78)
!105 = distinct !DISubprogram(name: "format_uint", linkageName: "__io_format_uint", scope: !1, file: !1, line: 15, type: !106, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !96)
!106 = !DISubroutineType(types: !107)
!107 = !{null, !81, !108}
!108 = !DIBasicType(name: "uint", size: 64, encoding: DW_ATE_unsigned)
!109 = !DILocation(line: 15, scope: !105)
!110 = !DILocalVariable(name: "b", scope: !105, file: !1, line: 15, type: !81)
!111 = !DILocalVariable(name: "num_in", arg: 1, scope: !105, file: !1, line: 15, type: !108)
!112 = !DILocation(line: 16, scope: !105)
!113 = !DILocalVariable(name: "temp", scope: !105, file: !1, line: 16, type: !114)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 8192, align: 32, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 256, lowerBound: 0)
!117 = !DILocation(line: 17, scope: !105)
!118 = !DILocalVariable(name: "num", scope: !105, file: !1, line: 17, type: !108)
!119 = !DILocation(line: 18, scope: !105)
!120 = !DILocation(line: 19, scope: !105)
!121 = !DILocation(line: 20, scope: !105)
!122 = !DILocation(line: 23, scope: !105)
!123 = !DILocalVariable(name: "count", scope: !105, file: !1, line: 23, type: !86)
!124 = !DILocation(line: 24, scope: !105)
!125 = !DILocation(line: 25, scope: !105)
!126 = !DILocalVariable(name: "digit", scope: !105, file: !1, line: 25, type: !108)
!127 = !DILocation(line: 26, scope: !105)
!128 = !DILocation(line: 27, scope: !105)
!129 = !DILocalVariable(name: "c", scope: !105, file: !1, line: 27, type: !108)
!130 = !DILocation(line: 28, scope: !105)
!131 = !DILocation(line: 29, scope: !105)
!132 = !DILocation(line: 32, scope: !105)
!133 = !DILocalVariable(name: "i", scope: !105, file: !1, line: 32, type: !86)
!134 = !DILocation(line: 33, scope: !105)
!135 = !DILocation(line: 35, scope: !105)
!136 = distinct !DISubprogram(name: "format_int", linkageName: "__io_format_int", scope: !1, file: !1, line: 37, type: !137, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !96)
!137 = !DISubroutineType(types: !138)
!138 = !{null, !81, !86}
!139 = !DILocation(line: 37, scope: !136)
!140 = !DILocalVariable(name: "b", scope: !136, file: !1, line: 37, type: !81)
!141 = !DILocalVariable(name: "num_in", arg: 1, scope: !136, file: !1, line: 37, type: !86)
!142 = !DILocation(line: 38, scope: !136)
!143 = !DILocalVariable(name: "temp", scope: !136, file: !1, line: 38, type: !114)
!144 = !DILocation(line: 39, scope: !136)
!145 = !DILocalVariable(name: "num", scope: !136, file: !1, line: 39, type: !86)
!146 = !DILocation(line: 40, scope: !136)
!147 = !DILocation(line: 41, scope: !136)
!148 = !DILocation(line: 42, scope: !136)
!149 = !DILocation(line: 45, scope: !136)
!150 = !DILocalVariable(name: "is_neg", scope: !136, file: !1, line: 45, type: !151)
!151 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!152 = !DILocation(line: 46, scope: !136)
!153 = !DILocation(line: 47, scope: !136)
!154 = !DILocation(line: 48, scope: !136)
!155 = !DILocation(line: 51, scope: !136)
!156 = !DILocalVariable(name: "count", scope: !136, file: !1, line: 51, type: !86)
!157 = !DILocation(line: 52, scope: !136)
!158 = !DILocation(line: 53, scope: !136)
!159 = !DILocalVariable(name: "digit", scope: !136, file: !1, line: 53, type: !86)
!160 = !DILocation(line: 54, scope: !136)
!161 = !DILocation(line: 55, scope: !136)
!162 = !DILocalVariable(name: "c", scope: !136, file: !1, line: 55, type: !89)
!163 = !DILocation(line: 56, scope: !136)
!164 = !DILocation(line: 57, scope: !136)
!165 = !DILocation(line: 60, scope: !136)
!166 = !DILocation(line: 62, scope: !136)
!167 = !DILocalVariable(name: "i", scope: !136, file: !1, line: 62, type: !86)
!168 = !DILocation(line: 63, scope: !136)
!169 = !DILocation(line: 65, scope: !136)
!170 = distinct !DISubprogram(name: "print_typetype", linkageName: "__io_print_typetype", scope: !1, file: !1, line: 127, type: !171, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !96)
!171 = !DISubroutineType(types: !172)
!172 = !{null, !81, !173}
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_TypeInfo", scope: !1, file: !1, size: 384, elements: !174)
!174 = !{!175, !177}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !1, file: !1, baseType: !176, size: 64, align: 64)
!176 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_TypeKind", scope: !83, file: !83, size: 64, align: 64, elements: !4)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !1, file: !1, baseType: !178, size: 320, align: 64, offset: 64)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_TypeUnion", scope: !1, file: !1, size: 320, elements: !179)
!179 = !{!180, !188, !202, !211, !216, !221, !224, !234, !240}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "basic", scope: !1, file: !1, baseType: !181, size: 256, align: 64)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_BasicType", scope: !1, file: !1, size: 256, elements: !182)
!182 = !{!183, !185, !186, !187}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !1, file: !1, baseType: !184, size: 64, align: 64)
!184 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_BasicKind", scope: !83, file: !83, size: 64, align: 64, elements: !16)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1, file: !1, baseType: !89, size: 32, align: 32, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1, file: !1, baseType: !89, size: 32, align: 32, offset: 96)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1, file: !1, baseType: !90, size: 128, align: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "struct_", scope: !1, file: !1, baseType: !189, size: 320, align: 64)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_StructType", scope: !1, file: !1, size: 320, elements: !190)
!190 = !{!191, !187, !201}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "members", scope: !1, file: !1, baseType: !192, size: 128, align: 64)
!192 = !DICompositeType(tag: DW_TAG_structure_type, scope: !83, file: !83, size: 128, align: 64, elements: !193)
!193 = !{!85, !194}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !83, file: !83, baseType: !195, size: 64, align: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*__init_StructMember", baseType: !196, size: 64, align: 64, dwarfAddressSpace: 0)
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_StructMember", scope: !83, file: !83, size: 192, elements: !197)
!197 = !{!198, !199}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !83, file: !83, baseType: !90, size: 128, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !83, file: !83, baseType: !200, size: 64, align: 64, offset: 128)
!200 = !DIBasicType(name: "type", size: 64, encoding: DW_ATE_unsigned)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1, file: !1, baseType: !89, size: 32, align: 32, offset: 256)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !1, file: !1, baseType: !203, size: 192, align: 64)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_FunctionType", scope: !1, file: !1, size: 192, elements: !204)
!204 = !{!205, !206}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "return_", scope: !1, file: !1, baseType: !200, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "args_t", scope: !1, file: !1, baseType: !207, size: 128, align: 64, offset: 64)
!207 = !DICompositeType(tag: DW_TAG_structure_type, scope: !83, file: !83, size: 128, align: 64, elements: !208)
!208 = !{!85, !209}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !83, file: !83, baseType: !210, size: 64, align: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*type", baseType: !200, size: 64, align: 64, dwarfAddressSpace: 0)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1, file: !1, baseType: !212, size: 128, align: 64)
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_PointerType", scope: !1, file: !1, size: 128, elements: !213)
!213 = !{!214, !215}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "pointee", scope: !1, file: !1, baseType: !200, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "is_optional", scope: !1, file: !1, baseType: !151, size: 8, align: 8, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !1, file: !1, baseType: !217, size: 128, align: 64)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_ArrayType", scope: !1, file: !1, size: 128, elements: !218)
!218 = !{!219, !220}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !1, file: !1, baseType: !200, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "member_count", scope: !1, file: !1, baseType: !89, size: 32, align: 32, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "slice", scope: !1, file: !1, baseType: !222, size: 64, align: 64)
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_SliceType", scope: !1, file: !1, size: 64, elements: !223)
!223 = !{!219}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "enum_", scope: !1, file: !1, baseType: !225, size: 320, align: 64)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_EnumType", scope: !1, file: !1, size: 320, elements: !226)
!226 = !{!227, !228, !233}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1, file: !1, baseType: !90, size: 128, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "member_names", scope: !1, file: !1, baseType: !229, size: 128, align: 64, offset: 128)
!229 = !DICompositeType(tag: DW_TAG_structure_type, scope: !83, file: !83, size: 128, align: 64, elements: !230)
!230 = !{!85, !231}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !83, file: !83, baseType: !232, size: 64, align: 64, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*string", baseType: !90, size: 64, align: 64, dwarfAddressSpace: 0)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !1, file: !1, baseType: !200, size: 64, align: 64, offset: 256)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !1, file: !1, baseType: !235, size: 128, align: 64)
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_VectorType", scope: !1, file: !1, size: 128, elements: !236)
!236 = !{!237, !239}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !1, file: !1, baseType: !238, size: 64, align: 64)
!238 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_VectorKind", scope: !83, file: !83, size: 64, align: 64, elements: !51)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "elem_count", scope: !1, file: !1, baseType: !89, size: 32, align: 32, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !1, file: !1, baseType: !241, size: 128, align: 64)
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_GenericType", scope: !1, file: !1, size: 128, elements: !242)
!242 = !{!227}
!243 = !DILocation(line: 127, scope: !170)
!244 = !DILocalVariable(name: "b", scope: !170, file: !1, line: 127, type: !81)
!245 = !DILocalVariable(name: "info", arg: 1, scope: !170, file: !1, line: 127, type: !173)
!246 = !DILocation(line: 128, scope: !170)
!247 = !DILocation(line: 130, scope: !170)
!248 = !DILocation(line: 133, scope: !170)
!249 = !DILocation(line: 136, scope: !170)
!250 = !DILocation(line: 137, scope: !170)
!251 = !DILocalVariable(name: "args", scope: !170, file: !1, line: 137, type: !207)
!252 = !DILocation(line: 138, scope: !170)
!253 = !DILocalVariable(name: "arg", scope: !170, file: !1, line: 138, type: !200)
!254 = !DILocalVariable(name: "i", scope: !170, file: !1, line: 138, type: !86)
!255 = !DILocation(line: 139, scope: !170)
!256 = !DILocation(line: 140, scope: !170)
!257 = !DILocation(line: 141, scope: !170)
!258 = !DILocation(line: 144, scope: !170)
!259 = !DILocation(line: 145, scope: !170)
!260 = !DILocation(line: 146, scope: !170)
!261 = !DILocation(line: 147, scope: !170)
!262 = !DILocation(line: 151, scope: !170)
!263 = !DILocation(line: 154, scope: !170)
!264 = !DILocation(line: 155, scope: !170)
!265 = !DILocation(line: 158, scope: !170)
!266 = !DILocation(line: 159, scope: !170)
!267 = !DILocation(line: 162, scope: !170)
!268 = !DILocation(line: 163, scope: !170)
!269 = !DILocation(line: 166, scope: !170)
!270 = !DILocation(line: 169, scope: !170)
!271 = !DILocation(line: 172, scope: !170)
!272 = !DILocation(line: 176, scope: !170)
!273 = distinct !DISubprogram(name: "print_type", linkageName: "__io_print_type", scope: !1, file: !1, line: 178, type: !274, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !96)
!274 = !DISubroutineType(types: !275)
!275 = !{null, !81, !276}
!276 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_Arg", scope: !1, file: !1, size: 128, elements: !277)
!277 = !{!219, !278}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1, file: !1, baseType: !279, size: 64, align: 64, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*void", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!280 = !DILocation(line: 178, scope: !273)
!281 = !DILocalVariable(name: "b", scope: !273, file: !1, line: 178, type: !81)
!282 = !DILocalVariable(name: "arg", arg: 1, scope: !273, file: !1, line: 178, type: !276)
!283 = !DILocation(line: 179, scope: !273)
!284 = !DILocalVariable(name: "t", scope: !273, file: !1, line: 179, type: !173)
!285 = !DILocation(line: 180, scope: !273)
!286 = !DILocation(line: 184, scope: !273)
!287 = !DILocalVariable(name: "basic", scope: !273, file: !1, line: 184, type: !181)
!288 = !DILocation(line: 185, scope: !273)
!289 = !DILocation(line: 186, scope: !273)
!290 = !DILocation(line: 187, scope: !273)
!291 = !DILocation(line: 189, scope: !273)
!292 = !DILocation(line: 192, scope: !273)
!293 = !DILocation(line: 193, scope: !273)
!294 = !DILocalVariable(name: "str", scope: !273, file: !1, line: 193, type: !90)
!295 = !DILocation(line: 194, scope: !273)
!296 = !DILocation(line: 203, scope: !273)
!297 = !DILocation(line: 204, scope: !273)
!298 = !DILocalVariable(name: "num", scope: !273, file: !1, line: 204, type: !108)
!299 = !DILocation(line: 205, scope: !273)
!300 = !DILocation(line: 207, scope: !273)
!301 = !DILocation(line: 208, scope: !273)
!302 = !DILocalVariable(name: "num", scope: !273, file: !1, line: 208, type: !108)
!303 = !DILocation(line: 209, scope: !273)
!304 = !DILocation(line: 211, scope: !273)
!305 = !DILocation(line: 212, scope: !273)
!306 = !DILocalVariable(name: "num", scope: !273, file: !1, line: 212, type: !108)
!307 = !DILocation(line: 213, scope: !273)
!308 = !DILocation(line: 215, scope: !273)
!309 = !DILocation(line: 216, scope: !273)
!310 = !DILocalVariable(name: "num", scope: !273, file: !1, line: 216, type: !108)
!311 = !DILocation(line: 217, scope: !273)
!312 = !DILocation(line: 219, scope: !273)
!313 = !DILocation(line: 220, scope: !273)
!314 = !DILocalVariable(name: "num", scope: !273, file: !1, line: 220, type: !86)
!315 = !DILocation(line: 221, scope: !273)
!316 = !DILocation(line: 223, scope: !273)
!317 = !DILocation(line: 224, scope: !273)
!318 = !DILocalVariable(name: "num", scope: !273, file: !1, line: 224, type: !86)
!319 = !DILocation(line: 225, scope: !273)
!320 = !DILocation(line: 227, scope: !273)
!321 = !DILocation(line: 228, scope: !273)
!322 = !DILocalVariable(name: "num", scope: !273, file: !1, line: 228, type: !86)
!323 = !DILocation(line: 229, scope: !273)
!324 = !DILocation(line: 231, scope: !273)
!325 = !DILocation(line: 232, scope: !273)
!326 = !DILocalVariable(name: "num", scope: !273, file: !1, line: 232, type: !86)
!327 = !DILocation(line: 233, scope: !273)
!328 = !DILocation(line: 235, scope: !273)
!329 = !DILocation(line: 236, scope: !273)
!330 = !DILocalVariable(name: "num", scope: !273, file: !1, line: 236, type: !86)
!331 = !DILocation(line: 237, scope: !273)
!332 = !DILocation(line: 239, scope: !273)
!333 = !DILocation(line: 240, scope: !273)
!334 = !DILocalVariable(name: "num", scope: !273, file: !1, line: 240, type: !108)
!335 = !DILocation(line: 241, scope: !273)
!336 = !DILocation(line: 243, scope: !273)
!337 = !DILocation(line: 244, scope: !273)
!338 = !DILocalVariable(name: "num", scope: !273, file: !1, line: 244, type: !339)
!339 = !DIBasicType(name: "f32", size: 32, encoding: DW_ATE_float)
!340 = !DILocation(line: 245, scope: !273)
!341 = !DILocation(line: 247, scope: !273)
!342 = !DILocation(line: 248, scope: !273)
!343 = !DILocalVariable(name: "num", scope: !273, file: !1, line: 248, type: !344)
!344 = !DIBasicType(name: "f64", size: 64, encoding: DW_ATE_float)
!345 = !DILocation(line: 249, scope: !273)
!346 = !DILocation(line: 251, scope: !273)
!347 = !DILocation(line: 252, scope: !273)
!348 = !DILocalVariable(name: "pt", scope: !273, file: !1, line: 252, type: !200)
!349 = !DILocation(line: 253, scope: !273)
!350 = !DILocalVariable(name: "info", scope: !273, file: !1, line: 253, type: !173)
!351 = !DILocation(line: 254, scope: !273)
!352 = !DILocation(line: 257, scope: !273)
!353 = !DILocation(line: 263, scope: !273)
!354 = !DILocalVariable(name: "st", scope: !273, file: !1, line: 263, type: !189)
!355 = !DILocation(line: 264, scope: !273)
!356 = !DILocation(line: 265, scope: !273)
!357 = !DILocation(line: 266, scope: !273)
!358 = !DILocalVariable(name: "n", scope: !273, file: !1, line: 266, type: !86)
!359 = !DILocation(line: 267, scope: !273)
!360 = !DILocalVariable(name: "m", scope: !273, file: !1, line: 267, type: !361)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_StructMember", scope: !1, file: !1, size: 192, elements: !362)
!362 = !{!227, !363}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !1, file: !1, baseType: !200, size: 64, align: 64, offset: 128)
!364 = !DILocation(line: 268, scope: !273)
!365 = !DILocation(line: 269, scope: !273)
!366 = !DILocation(line: 270, scope: !273)
!367 = !DILocation(line: 271, scope: !273)
!368 = !DILocalVariable(name: "ptr", scope: !273, file: !1, line: 271, type: !93)
!369 = !DILocation(line: 272, scope: !273)
!370 = !DILocalVariable(name: "offset", scope: !273, file: !1, line: 272, type: !86)
!371 = !DILocation(line: 273, scope: !273)
!372 = !DILocalVariable(name: "mem_arg", scope: !273, file: !1, line: 273, type: !276)
!373 = !DILocation(line: 277, scope: !273)
!374 = !DILocation(line: 279, scope: !273)
!375 = !DILocation(line: 280, scope: !273)
!376 = !DILocation(line: 281, scope: !273)
!377 = !DILocation(line: 284, scope: !273)
!378 = !DILocation(line: 299, scope: !273)
!379 = distinct !DISubprogram(name: "builder_to_string", linkageName: "__io_builder_to_string", scope: !1, file: !1, line: 301, type: !380, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !96)
!380 = !DISubroutineType(types: !381)
!381 = !{!382, !81}
!382 = !DICompositeType(tag: DW_TAG_structure_type, scope: !1, file: !1, size: 128, align: 64, elements: !383)
!383 = !{!384, !385}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1, file: !1, baseType: !86, size: 64, align: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1, file: !1, baseType: !93, size: 64, align: 64, offset: 64)
!386 = !DILocation(line: 301, scope: !379)
!387 = !DILocalVariable(name: "b_in", scope: !379, file: !1, line: 301, type: !81)
!388 = !DILocation(line: 302, scope: !379)
!389 = !DILocalVariable(name: "b", scope: !379, file: !1, line: 302, type: !81)
!390 = !DILocation(line: 303, scope: !379)
!391 = !DILocalVariable(name: "alloc", scope: !379, file: !1, line: 303, type: !392)
!392 = !DICompositeType(tag: DW_TAG_structure_type, name: "__mem_Allocator", scope: !1, file: !1, size: 192, elements: !393)
!393 = !{!394, !400, !404}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1, file: !1, baseType: !395, size: 64, align: 64)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*fn(int, *__mem_Allocator) -> ?*", baseType: !396, size: 64, align: 64, dwarfAddressSpace: 0)
!396 = !DISubroutineType(types: !397)
!397 = !{!279, !86, !398}
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*__mem_Allocator", baseType: !399, size: 64, align: 64, dwarfAddressSpace: 0)
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "__mem_Allocator", scope: !83, file: !83, size: 192, align: 64, flags: DIFlagFwdDecl)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !1, file: !1, baseType: !401, size: 64, align: 64, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*fn(*, *__mem_Allocator)", baseType: !402, size: 64, align: 64, dwarfAddressSpace: 0)
!402 = !DISubroutineType(types: !403)
!403 = !{null, !279, !398}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1, file: !1, baseType: !279, size: 64, align: 64, offset: 128)
!405 = !DILocation(line: 304, scope: !379)
!406 = !DILocalVariable(name: "res", scope: !379, file: !1, line: 304, type: !382)
!407 = !DILocation(line: 306, scope: !379)
!408 = !DILocalVariable(name: "i", scope: !379, file: !1, line: 306, type: !86)
!409 = !DILocation(line: 307, scope: !379)
!410 = !DILocalVariable(name: "ptr", scope: !379, file: !1, line: 307, type: !93)
!411 = !DILocation(line: 308, scope: !379)
!412 = !DILocation(line: 309, scope: !379)
!413 = !DILocation(line: 310, scope: !379)
!414 = !DILocation(line: 313, scope: !379)
!415 = !DILocalVariable(name: "size", scope: !379, file: !1, line: 313, type: !86)
!416 = !DILocation(line: 314, scope: !379)
!417 = !DILocalVariable(name: "j", scope: !379, file: !1, line: 314, type: !86)
!418 = !DILocation(line: 315, scope: !379)
!419 = !DILocation(line: 319, scope: !379)
!420 = distinct !DISubprogram(name: "print_type_with_formatter", linkageName: "__io_print_type_with_formatter", scope: !1, file: !1, line: 322, type: !421, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !96)
!421 = !DISubroutineType(types: !422)
!422 = !{null, !81, !89, !276}
!423 = !DILocation(line: 322, scope: !420)
!424 = !DILocalVariable(name: "b", scope: !420, file: !1, line: 322, type: !81)
!425 = !DILocalVariable(name: "c", arg: 1, scope: !420, file: !1, line: 322, type: !89)
!426 = !DILocalVariable(name: "arg", arg: 2, scope: !420, file: !1, line: 322, type: !276)
!427 = !DILocation(line: 323, scope: !420)
!428 = !DILocalVariable(name: "t", scope: !420, file: !1, line: 323, type: !173)
!429 = !DILocation(line: 324, scope: !420)
!430 = !DILocation(line: 325, scope: !420)
!431 = !DILocalVariable(name: "str", scope: !420, file: !1, line: 325, type: !93)
!432 = !DILocation(line: 326, scope: !420)
!433 = !DILocalVariable(name: "i", scope: !420, file: !1, line: 326, type: !86)
!434 = !DILocation(line: 327, scope: !420)
!435 = !DILocation(line: 330, scope: !420)
!436 = !DILocation(line: 331, scope: !420)
!437 = !DILocation(line: 332, scope: !420)
!438 = !DILocation(line: 334, scope: !420)
!439 = distinct !DISubprogram(name: "__internal_print", linkageName: "__io___internal_print", scope: !1, file: !1, line: 336, type: !440, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !96)
!440 = !DISubroutineType(types: !441)
!441 = !{!82, !90, !442}
!442 = !DICompositeType(tag: DW_TAG_structure_type, scope: !83, file: !83, size: 128, align: 64, elements: !443)
!443 = !{!85, !444}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !83, file: !83, baseType: !445, size: 64, align: 64, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*__init_Arg", baseType: !446, size: 64, align: 64, dwarfAddressSpace: 0)
!446 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_Arg", scope: !83, file: !83, size: 128, elements: !447)
!447 = !{!448, !449}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !83, file: !83, baseType: !200, size: 64, align: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !83, file: !83, baseType: !279, size: 64, align: 64, offset: 64)
!450 = !DILocation(line: 336, scope: !439)
!451 = !DILocalVariable(name: "fmt", scope: !439, file: !1, line: 336, type: !90)
!452 = !DILocalVariable(name: "args", arg: 1, scope: !439, file: !1, line: 336, type: !442)
!453 = !DILocation(line: 337, scope: !439)
!454 = !DILocalVariable(name: "alloc", scope: !439, file: !1, line: 337, type: !392)
!455 = !DILocation(line: 338, scope: !439)
!456 = !DILocalVariable(name: "builder", scope: !439, file: !1, line: 338, type: !82)
!457 = !DILocation(line: 339, scope: !439)
!458 = !DILocalVariable(name: "arg_count", scope: !439, file: !1, line: 339, type: !86)
!459 = !DILocation(line: 340, scope: !439)
!460 = !DILocalVariable(name: "need_to_print_arg", scope: !439, file: !1, line: 340, type: !151)
!461 = !DILocation(line: 341, scope: !439)
!462 = !DILocalVariable(name: "c", scope: !439, file: !1, line: 341, type: !89)
!463 = !DILocalVariable(name: "i", scope: !439, file: !1, line: 341, type: !86)
!464 = !DILocation(line: 342, scope: !439)
!465 = !DILocation(line: 343, scope: !439)
!466 = !DILocation(line: 345, scope: !439)
!467 = !DILocation(line: 346, scope: !439)
!468 = !DILocalVariable(name: "arg", scope: !439, file: !1, line: 346, type: !276)
!469 = !DILocation(line: 347, scope: !439)
!470 = !DILocation(line: 348, scope: !439)
!471 = !DILocation(line: 349, scope: !439)
!472 = !DILocation(line: 351, scope: !439)
!473 = !DILocation(line: 356, scope: !439)
!474 = !DILocation(line: 357, scope: !439)
!475 = !DILocalVariable(name: "arg", scope: !439, file: !1, line: 357, type: !276)
!476 = !DILocation(line: 358, scope: !439)
!477 = !DILocation(line: 359, scope: !439)
!478 = !DILocation(line: 360, scope: !439)
!479 = !DILocation(line: 363, scope: !439)
!480 = distinct !DISubprogram(name: "vsprint", linkageName: "__io_vsprint", scope: !1, file: !1, line: 366, type: !481, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !96)
!481 = !DISubroutineType(types: !482)
!482 = !{!90, !90, !442}
!483 = !DILocation(line: 366, scope: !480)
!484 = !DILocalVariable(name: "str", scope: !480, file: !1, line: 366, type: !90)
!485 = !DILocalVariable(name: "args", arg: 1, scope: !480, file: !1, line: 366, type: !442)
!486 = !DILocation(line: 367, scope: !480)
!487 = !DILocalVariable(name: "builder", scope: !480, file: !1, line: 367, type: !82)
!488 = !DILocation(line: 368, scope: !480)
!489 = !DILocalVariable(name: "res", scope: !480, file: !1, line: 368, type: !382)
!490 = !DILocation(line: 369, scope: !480)
!491 = !DILocation(line: 370, scope: !480)
!492 = distinct !DISubprogram(name: "sprint", linkageName: "__io_sprint", scope: !1, file: !1, line: 373, type: !493, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !96)
!493 = !DISubroutineType(types: !494)
!494 = !{!90, !90}
!495 = !DILocation(line: 373, scope: !492)
!496 = !DILocalVariable(name: "str", scope: !492, file: !1, line: 373, type: !90)
!497 = !DILocalVariable(name: "args", arg: 1, scope: !492, file: !1, line: 373, type: !442)
!498 = !DILocation(line: 374, scope: !492)
!499 = !DILocalVariable(name: "builder", scope: !492, file: !1, line: 374, type: !82)
!500 = !DILocation(line: 375, scope: !492)
!501 = !DILocalVariable(name: "res", scope: !492, file: !1, line: 375, type: !382)
!502 = !DILocation(line: 376, scope: !492)
!503 = !DILocation(line: 377, scope: !492)
!504 = distinct !DISubprogram(name: "print", linkageName: "__io_print", scope: !1, file: !1, line: 380, type: !505, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !96)
!505 = !DISubroutineType(types: !506)
!506 = !{null, !90}
!507 = !DILocation(line: 380, scope: !504)
!508 = !DILocalVariable(name: "str", scope: !504, file: !1, line: 380, type: !90)
!509 = !DILocalVariable(name: "args", arg: 1, scope: !504, file: !1, line: 380, type: !442)
!510 = !DILocation(line: 381, scope: !504)
!511 = !DILocalVariable(name: "builder", scope: !504, file: !1, line: 381, type: !82)
